## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:40" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:40" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 40 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6b37f8b0bc9fdf8b1860a5ea667850b5-5" -> "25b702816c70619caecb95d3904c854e"
      ~ id                     = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip" -> (known after apply)
      ~ key                    = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip" -> "cpfValidation.25b702816c70619caecb95d3904c854e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "33197d2b5c1fd56ba250eb5e465a0c4b" -> "25b702816c70619caecb95d3904c854e"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "hymgzUnF6..mqfPH4k5fB6mqFeXFh7gB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "609a397e9343c863307b70227cbb2c9a-6" -> "6c59fbf48ef87b782a42adb663089644"
      ~ id                     = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip" -> (known after apply)
      ~ key                    = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip" -> "excelToJson.6c59fbf48ef87b782a42adb663089644.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "a353743c6db71a81967ec6cbdfe9b209" -> "6c59fbf48ef87b782a42adb663089644"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "GSieLRtcFLwd9AAcTZC9AOiYT_puNDlj" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "14fde8b6214cc06eac76e96704c38260-6" -> "bdcc89a7a7eb5a7ca5b6268b346d0bd1"
      ~ id                     = "graphql.a69909464baa18857436b267071324da.zip" -> (known after apply)
      ~ key                    = "graphql.a69909464baa18857436b267071324da.zip" -> "graphql.bdcc89a7a7eb5a7ca5b6268b346d0bd1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "a69909464baa18857436b267071324da" -> "bdcc89a7a7eb5a7ca5b6268b346d0bd1"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "rlhwWTKzwJCDiyqD6jOUsaugZcjNgHp6" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ac7cd0cb3c79214d3745561b5b85852f" -> "5f8bb2a268da4419396ec04a830f0057"
        id                     = "dist/200.html"
      ~ source_hash            = "ac7cd0cb3c79214d3745561b5b85852f" -> "5f8bb2a268da4419396ec04a830f0057"
        tags                   = {}
      ~ version_id             = "J1u1E2f3hycLQBVEW_FxOX5tlZEAuGb_" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6a5d36c5217fb1fee54ed9f66533f5ed" -> "d615e4e4abd4d2366c23746fa1e8a41b"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "6a5d36c5217fb1fee54ed9f66533f5ed" -> "d615e4e4abd4d2366c23746fa1e8a41b"
        tags                   = {}
      ~ version_id             = "vKSn0gTt2rjWTwSoZQgw92YdcIktQmpu" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b0b7e87d713459f1233c96f434e712ea" -> "08e6556736d84050e8a71ab3b0c3dd60"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "b0b7e87d713459f1233c96f434e712ea" -> "08e6556736d84050e8a71ab3b0c3dd60"
        tags                   = {}
      ~ version_id             = "QqKqN7p4eah84Hym.w_z7fWC5Pu7922I" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ac7cd0cb3c79214d3745561b5b85852f" -> "5f8bb2a268da4419396ec04a830f0057"
        id                     = "dist/index.html"
      ~ source_hash            = "ac7cd0cb3c79214d3745561b5b85852f" -> "5f8bb2a268da4419396ec04a830f0057"
        tags                   = {}
      ~ version_id             = "MDlATu0DQbHI9i4ggz2vSSPHtBF.rK.l" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.03253379.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadPage.03253379.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "feba19b47769d3c56ddb3eb5b0954af8" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.03253379.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadPage.03253379.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.03253379.chunk.js" -> null
-       source_hash            = "feba19b47769d3c56ddb3eb5b0954af8" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "VPVcZf2gR7F9EeGJyLJKmWufcqHpvv6G" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.03253379.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadPage.03253379.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "4b28630de6bdf18c74380d0d9f1a0ec2" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.03253379.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadPage.03253379.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.03253379.chunk.js.LICENSE.txt" -> null
-       source_hash            = "4b28630de6bdf18c74380d0d9f1a0ec2" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "5LUe9tBYZ2qp5W7cvw1iRLU1tCg7hh1p" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.059ecd68.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "0a33f4ef35318e46e7e3cc13d3b7222b"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.059ecd68.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.059ecd68.chunk.js"
+       source_hash            = "0a33f4ef35318e46e7e3cc13d3b7222b"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.059ecd68.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "d689cd265c1ce16ec8af9d94ea42d4f3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.059ecd68.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.059ecd68.chunk.js.LICENSE.txt"
+       source_hash            = "d689cd265c1ce16ec8af9d94ea42d4f3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bb0182a1.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.bb0182a1.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a6a5f7d785ca9e3cdf219486287d1a62" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bb0182a1.chunk.js" -> null
-       source_hash            = "a6a5f7d785ca9e3cdf219486287d1a62" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "pxd3fF7QCpUfHwMU53fD3Peb3zDo5kg1" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "43ff778014632a7ef9766fd4374290b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bb0182a1.chunk.js.LICENSE.txt" -> null
-       source_hash            = "43ff778014632a7ef9766fd4374290b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Pnb6lyxCpQ.CbRubrE6swjzdsgb08A9E" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.c5e351d1.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "20a89ac3ccdfb7d270507538fc988308"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.c5e351d1.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.c5e351d1.chunk.js"
+       source_hash            = "20a89ac3ccdfb7d270507538fc988308"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.c5e351d1.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "43ff778014632a7ef9766fd4374290b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.c5e351d1.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.c5e351d1.chunk.js.LICENSE.txt"
+       source_hash            = "43ff778014632a7ef9766fd4374290b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.1941d3ae.js"] will be destroyed
  # (because key ["static/js/app.1941d3ae.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "ed757c8d136f800fe9f4666ed71945c2" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.1941d3ae.js" -> null
-       key                    = "dist/static/js/app.1941d3ae.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.1941d3ae.js" -> null
-       source_hash            = "ed757c8d136f800fe9f4666ed71945c2" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "mKvqObaLIHxkAw2j3li1i7cvqakXWmip" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.1941d3ae.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.1941d3ae.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d38c03ef794fa32760c896577fdf875" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.1941d3ae.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.1941d3ae.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.1941d3ae.js.LICENSE.txt" -> null
-       source_hash            = "8d38c03ef794fa32760c896577fdf875" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "alDjwY_c6Nehr2AaCfwMsxbeXISfYqxd" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7ee95e96.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "9b633d304782340d73f923bb35fb10e6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7ee95e96.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7ee95e96.js"
+       source_hash            = "9b633d304782340d73f923bb35fb10e6"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7ee95e96.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8d38c03ef794fa32760c896577fdf875"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7ee95e96.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7ee95e96.js.LICENSE.txt"
+       source_hash            = "8d38c03ef794fa32760c896577fdf875"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.2345ee21.js"] will be destroyed
  # (because key ["static/js/runtime-app.2345ee21.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4f6a9f5d4b0fed3671985f70aad10f05" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.2345ee21.js" -> null
-       key                    = "dist/static/js/runtime-app.2345ee21.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.2345ee21.js" -> null
-       source_hash            = "4f6a9f5d4b0fed3671985f70aad10f05" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "OKMnZm54gV77LAY4tAq6TTnZEPT79u2s" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.6fb7e578.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5e0e9c38a4c4001b3ebcf8ec78336813"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.6fb7e578.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.6fb7e578.js"
+       source_hash            = "5e0e9c38a4c4001b3ebcf8ec78336813"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-01-20T02:49:03.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:9/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip" -> "cpfValidation.25b702816c70619caecb95d3904c854e.zip"
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8" -> "550fc0fa3a6bf3db533e5c445458695999397499"
              ~ "DD_TAGS"                      = "git.commit.sha:9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:550fc0fa3a6bf3db533e5c445458695999397499,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8" -> "550fc0fa3a6bf3db533e5c445458695999397499"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-01-20T02:49:03.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:9/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip" -> "excelToJson.6c59fbf48ef87b782a42adb663089644.zip"
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8" -> "550fc0fa3a6bf3db533e5c445458695999397499"
              ~ "DD_TAGS"                      = "git.commit.sha:9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:550fc0fa3a6bf3db533e5c445458695999397499,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8" -> "550fc0fa3a6bf3db533e5c445458695999397499"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-01-20T02:49:19.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:56" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:56/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.a69909464baa18857436b267071324da.zip" -> "graphql.bdcc89a7a7eb5a7ca5b6268b346d0bd1.zip"
        tags                           = {}
      ~ version                        = "56" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8" -> "550fc0fa3a6bf3db533e5c445458695999397499"
              ~ "DD_TAGS"                            = "git.commit.sha:9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:550fc0fa3a6bf3db533e5c445458695999397499,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "9f7f4ddc11b3b987d4f1d1e19ffd9282735a62f8" -> "550fc0fa3a6bf3db533e5c445458695999397499"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "56" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 14 to add, 8 to change, 14 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7616730790)*